q = {'ab': 1, 'bc' : 2, 'cd': 3, 'de': 4, 'ef': 5}
# w = (f'Здравствуйте'['ab'], 'Прекрасная профессия' [1])
for x, y in q.items():
	print(f'Здравствуйте {x}, Прекрасная профессия {y}')	
	


	# # x = (f'Здравствуйте'{x})
	# # y = (f'Прекрасная профессия'{y})
	# print(x ,y)


# key, value

# Создайте Dictionary с 5 элементами где ключи это их имена, а значение их профессия.
# С помощь цикла for пройти вывести на экран строку:
# "Здравствуйте <Имя>  Прекрасная профессия <Профессия>"