
z = {}
i = 0
while i < 3:
	i += 1
	x = input('имя пользователя: ')
	y = input('пароль: ')
	z[x] = y
print(z)



# Создайте пустой словарь.

# Запустите цикл который 3 раза спросит его имя и его пароль.

# Записывайте имя пользователя как ключ, а пароль как его значение.