q = {1,2,4,3,5,}
w = {6}
q.update(w)
print(q)

q.pop()
print(q)

set5={3,4,4,5,6}
set6=set5.add(7)
print(set5)
set5.pop()
print(set5)



# Создайте SET из 5 элементов. Потом добавьте в SET ещё один элемент.
# А затем удалите через .pop() элемент и посмотрите что же вы удалили