set1 = {'.add("*")', '.remove("*")', '.clear()', '.update("*")', '.difference("*")', '.discard("*")', '.intersection("*")', '.intersection_update(*)', '.pop()'}
set2 = {'.clear()', '.get("*")', '.values()', '.items()', '.update("*")', '.pop()'}
set2.intersection_update(set1)
# q = (set(set2).difference(set1))
print(set2)



# Создайте SET который хранит в себе все методы  для работы  с  SET.

# Создайте второй SET который хранит в себе  методы  для работы  с  Dictionary которые вы сегодня узнали.

# Проверьте какие методы похожи у этих типов данные.