z = set()
# i = 0
# while i < 10:
#     i += 1
#     x = input('введите 10 чисел: ',)
#     z.add(x)
# print(z)


for x in range (1,11):
	x = int(input('введите 10 чисел: '))
	z.add(x)
print(tuple(z))

# z.add(12)
# print(z)










# Создайте цикл который справшивает у пользователя 10 чисел и добавьте их в SET.
# Сделайте так чтобы эти данные уже никто не смог поменять позже.