farm2 = {"cow", "horse", "donkey", "cat", "dog"}
farm1 = {"dog", "cat", "mouse", "sheep"}
farm2.difference_update(farm1)
print(farm2)








# Из Google Colab Множество 3 и 4

# Напишите код, который выведет новое множество, состоящее из животных,
# которые есть во второй ферме, но нет в первой.



# # Множество № 2:
# farm_1 = {"dog", "cat", "mouse", "sheep"}
 
# # Множество № 3:
# farm_2 = {"cow", "horse", "donkey", "cat", "dog"}

# a = input("Number a: ")
# symbol = input("What to do? ")
# b = input("Number b: ")
 
# if symbol == '+':
#   print(int(a) + int(b))