a = 2
b = 7
c = 19.5
d = 1
e = 10
print()

# Создать 5 переменных:
# a.Чётное число
# b.Любое от 5 до 15
# c.Дробное число до 20
# d.Любое нечётное число
# e.Любое число