num = 7
i = 0
while i < 5:
	num = num * 7
	print(num)
	i += 1


# 3. Напишите код, который берёт цифру 7, умножает саму на себя
#     же 5 раз. 
 
	