even =''
odd=''
for index, char in enumerate (['Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',]):
    if (index % 2 == 0):
        even += char
    else: odd += char
print (odd)

'''# 7. У вас всё тот же список имён:
#     names = ('Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',)
#     Выведите каждое 2 имя.
#     Подсказка: Всего имён 13.
 '''