# a = ['Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',]
# i = 0
# while a[i] != 13:
# 	print( a[i])
# 	i += 2
a = ['Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',]
print(len(a) % 2 == 0)


'''# 6. У вас есть список имён:
#     names = ('Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',)
#     Если первое имя = 0, второе имя = 1 и т.д.
#     Выведите на экран всё имена которые лежат на чётных числах'''