# Нужно создать класс который принимает Classroom Data #2 данные.
# И внутри класса создать несколько методов:
# Метод который вернёт все имена отелей.
# Метод который из собирает все name в один Tuple и locations в другой и возвращает dictionary c двумя ключами списками со всеми значениями.
# Метод который добавит к каждому элементу в markers поле 
# status_id: 1
data = {
"markers": [
{
"name": "Rixos The Palm Dubai",
"position": [25.1212, 55.1535],
},
{
"name": "Shangri-La Hotel",
"location": [25.2084, 55.2719]
},
{
"name": "Grand Hyatt",
"location": [25.2285, 55.3273]
}
]
}

