# a = input('Введите имя: ')
# b = input('Ваш возраст: ')
# c = input('Ваш любимый фильм: ')
# print(f'Введите имя {a}, Ваш возраст {b}, Ваш любимый фильм {c}')
# print(f'Здравcтвуйте {a}, Ваш любимый фильм {c} классный')

a = input('Введите имя: ')
b = input('Ваш возраст: ')
c = input('Ваш любимый фильм?: ')
print('Введите имя {}, Ваш возраст {}, Ваш любимый фильм {}'.format(a, b, c))
print('Здравcтвуйте {}, Ваш любимый фильм {} классный'.format(a, c))



# '''Спросить у пользователя имя, возраст и любимый фильм.

# 1.Поприветствовать по имени.
# 2.Похвалить его фильм.'''