s = "У вас есть строка 'Запуск Ethereum 2.0 состоится 1 декабря. На депозитный контракт внесено более 524 288 ETH'"
d = s.split()
for y in d:
	print (y, type(y))




# q = 'Запуск Ethereum состоитс декабря. На депозитный контракт внесено более ETH'
# w = 2.0
# r = 1
# t = 524288 
# print(type (q))
# print(type (w))
# print(type (r))
# print(type (t))



# Взять строку №8 из Google Collab поделить её по пробелам и узнать тип данных каждого слова.
# Строка №8:
# "У вас есть строка 'Запуск Ethereum 2.0 состоится 1 декабря. На депозитный контракт внесено более 524 288 ETH'"