q = ['a': 1, 'b' : 2, 'c': 3, 'd': 4, 'e': 5]
w = 'Здравствуйте [a]', 'Прекрасная профессия [1]'
for w in q:
	print(w)




# Создайте Dictionary с 5 элементами где ключи это их имена, а значение их профессия.
# С помощь цикла for пройти вывести на экран строку:
# "Здравствуйте <Имя>  Прекрасная профессия <Профессия>"