# Напишите функцию которая спрашивает у пользователя число и 
# выводит ему на экран именно столько строк самой себя как текст.

def rep():
    a = int(input())
    for x in range(a):
        print(f == str(a))

rep(False)

