# Создайте 4 функции: add(), substract(), multiply(), divide() 
# которые будут принимать по 2 аргумента и возвращать результат: 
# сложения, вычитания, умножения и деления. 

def add(a, b):
	print(a + b)


def substract(a, b):
	print(a - b)

def multiply(a, b):
	print(a * b)

def divide(a, b):
	print(a / b)

add(10, 10)
substract(10, 10)
multiply(10, 10)
divide(10, 10)