a = 10
if a == True:
	print("да")
else:
	print("в любом случае")

'''Создайте условие которое будет срабатывать в любом случае'''
