a=(-1)
if a<0:
	print("отрицательный")
if a>0:
	print("положительный")
'''Напишите условие, которое выводит отрицательные числа'''