a=int(input('Введите число: '))
print(a)
if a==0:
	print("yes")
b=30%3
print(b)
if b==0:
	print("yes")
c=30**2
print(c)
if c>1000 or c==1000:
	print("yes")
else:
	print("not")
  

'''Написать программу которая проверит число на несколько критериев:
Чётное ли число?
Делится ли число на 3 без остатка?
Если возвести его в квадрат, больше ли оно 1000?'''
