list = ['zx', 'cv', 'bn', 'mk', 'qw']
# list()
print ("-".join(list)) 



# 1.Создать Лист из 5 разных имён.
# 2.Создать пустую строку и через .join() соеденить пустую строку и все имена в списке.