tup = ("asd", 1, 'fgh')
print(tup[0])
print(tup[1])
print(tup[2])

tup = ("asd", 1, 'fgh')
print(tup[::])



# Создать Tuple из 3 элементов и вывести каждый из них по индексу.