list = [(1, 2, 3), ('asdf'), ('sdfghj'), (1, 23, 46), ('hgyduhjfkd')]
print(len(list))

# l = [t1,t2,t3,t4,t5]
# print(l)





# Создать список и 5 вложенных кортежей.