list = [152, 'asdfg', (1), 2.5, True]
print (list)
# list1.append(1)
# list1.append('sdfds')
# list1.append(5.5)
# list1.append([12, 'ghfjkg'])
# list1.append((1, 2, 3))
# print(list)
# Создать Лист и заполнить его 5 РАЗНЫМИ ТИПАМИ ДАННЫХ.