a = [input('Ваше Имя :'), input('Год Рождения :'), input('любимый Язык Программирования :')]
print(a)




# Создать пустой лист.
# Добавить в него сначала Ваше Имя, Год Рождения, любимый Язык Программирования.